tap 'warrensbox/tap'                                    ## https://github.com/warrensbox/homebrew-tap
{{ if eq .chezmoi.os "darwin" -}}
{{ if eq .machine.type "work" -}}
tap 'hashicorp/tap'                                     ## https://github.com/hashicorp/homebrew-tap
{{ end }}
{{ end -}}

## ================================================================================================================== ##
##                                                       Shells                                                       ##
## ================================================================================================================== ##
brew 'bash'                                             ## https://git.savannah.gnu.org/git/bash.git
brew 'zsh'                                              ## https://github.com/zsh-users/zsh (MIRROR)

## ================================================================================================================== ##
##                                                       Tools                                                        ##
## ================================================================================================================== ##
brew 'act'                                              ## https://github.com/nektos/act
brew 'ag'                                               ## https://github.com/ggreer/the_silver_searcher
brew 'age'                                              ## https://github.com/FiloSottile/age
brew 'artillery'                                        ## https://github.com/artilleryio/artillery
brew 'asciinema'                                        ## https://github.com/asciinema/asciinema
brew 'aspell'                                           ## https://github.com/GNUAspell/aspell
brew 'bitwise'                                          ## https://github.com/mellowcandle/bitwise
brew 'bmon'                                             ## https://github.com/tgraf/bmon
brew 'btop'                                             ## https://github.com/aristocratos/btop
brew 'chezmoi'                                          ## https://github.com/twpayne/chezmoi
brew 'cloc'                                             ## https://github.com/AlDanial/cloc
brew 'cmake'                                            ## https://github.com/Kitware/CMake
brew 'cmctl'                                            ## https://github.com/cert-manager/cmctl
brew 'colima'                                           ## https://github.com/abiosoft/colima
brew 'cookiecutter'                                     ## https://github.com/cookiecutter/cookiecutter
brew 'copier'                                           ## https://github.com/copier-org/copier
brew 'ctop'                                             ## https://github.com/bcicen/ctop
brew 'curl'                                             ## https://github.com/curl/curl
brew 'diff-so-fancy'                                    ## https://github.com/so-fancy/diff-so-fancy
brew 'direnv'                                           ## https://github.com/direnv/direnv
brew 'dive'                                             ## https://github.com/wagoodman/dive
brew 'docker'                                           ## https://github.com/docker/cli
brew 'docker-buildx'                                    ## https://github.com/docker/buildx
brew 'docker-compose'                                   ## https://github.com/docker/compose
brew 'docker-credential-helper'                         ## https://github.com/docker/docker-credential-helpers
brew 'duf'                                              ## https://github.com/muesli/duf
brew 'fd'                                               ## https://github.com/sharkdp/fd
brew 'fx'                                               ## https://github.com/antonmedv/fx
brew 'fzf'                                              ## https://github.com/junegunn/fzf
brew 'gawk'                                             ## https://git.savannah.gnu.org/git/gawk.git
brew 'gh'                                               ## https://github.com/cli/cli
brew 'git'                                              ## https://github.com/git/git
brew 'git-delta'                                        ## https://github.com/dandavison/delta
brew 'git-lfs'                                          ## https://github.com/git-lfs/git-lfs
brew 'gnupg'                                            ## https://github.com/gpg/gnupg
brew 'goenv'                                            ## https://github.com/syndbg/goenv
brew 'gradle', args:["ignore-dependencies"]             ## https://github.com/gradle/gradle
brew 'hadolint'                                         ## https://github.com/hadolint/hadolint
brew 'has'                                              ## https://github.com/kdabir/has
brew 'htop'                                             ## https://github.com/htop-dev/htop
brew 'httpie'                                           ## https://github.com/httpie/httpie
brew 'jenv'                                             ## https://github.com/jenv/jenv
brew 'jo'                                               ## https://github.com/jpmens/jo
brew 'jq'                                               ## https://github.com/stedolan/jq
brew 'kcov'                                             ## https://github.com/SimonKagstrom/kcov
brew 'kics'                                             ## https://github.com/Checkmarx/kics
brew 'kubectl'                                          ## https://github.com/kubernetes/kubectl
brew 'lazydocker'                                       ## https://github.com/jesseduffield/lazydocker
brew 'lima-additional-guestagents'                      ## https://github.com/lima-vm/lima
brew 'lnav'                                             ## https://github.com/tstack/lnav
brew 'lsd'                                              ## https://github.com/Peltoche/lsd
brew 'lynis'                                            ## https://github.com/CISOfy/lynis
brew 'maven', args:["ignore-dependencies"]              ## https://github.com/apache/maven
brew 'moreutils'                                        ## https://git.joeyh.name/git/moreutils.git/
brew 'nmap'                                             ## https://github.com/nmap/nmap
brew 'node-build'                                       ## https://github.com/nodenv/node-build
brew 'nodenv'                                           ## https://github.com/nodenv/nodenv
brew 'onefetch'                                         ## https://github.com/o2sh/onefetch
brew 'opa'                                              ## https://github.com/open-policy-agent/opa
brew 'openssh'                                          ## https://github.com/openssh/openssh-portable
brew 'openssl'                                          ## https://github.com/openssl/openssl
brew 'perl-build'                                       ## https://github.com/tokuhirom/Perl-Build
brew 'pinentry'                                         ## https://github.com/gpg/pinentry
brew 'plenv'                                            ## https://github.com/tokuhirom/plenv
brew 'pre-commit'                                       ## https://github.com/pre-commit/pre-commit
brew 'progress'                                         ## https://github.com/Xfennec/progress
brew 'pyenv'                                            ## https://github.com/pyenv/pyenv
brew 'rbenv-bundler'                                    ## https://github.com/carsomyr/rbenv-bundler
brew 'rbenv'                                            ## https://github.com/rbenv/rbenv
brew 'ripgrep'                                          ## https://github.com/BurntSushi/ripgrep
brew 'rsync'                                            ## https://github.com/WayneD/rsync
brew 'ruby-build'                                       ## https://github.com/rbenv/ruby-build
brew 'shellcheck'                                       ## https://github.com/koalaman/shellcheck
brew 'sops'                                             ## https://github.com/mozilla/sops
brew 'sslscan'                                          ## https://github.com/rbsec/sslscan
brew 'stern'                                            ## https://github.com/stern/stern
brew 'terraform-docs', args:["ignore-dependencies"]     ## https://github.com/terraform-docs/terraform-docs
brew 'terramate', args:["ignore-dependencies"]          ## https://github.com/terramate-io/terramate
brew 'tflint'                                           ## https://github.com/terraform-linters/tflint
brew 'tfswitch'                                         ## https://github.com/warrensbox/terraform-switcher
brew 'tree'                                             ## https://github.com/Old-Man-Programmer/tree (MIRROR)
brew 'watch'                                            ## https://gitlab.com/procps-ng/procps
brew 'wget'                                             ## https://git.savannah.gnu.org/cgit/wget.git
brew 'xq'                                               ## https://github.com/sibprogrammer/xq
brew 'yarn'                                             ## https://github.com/yarnpkg/yarn
brew 'yq'                                               ## https://github.com/mikefarah/yq
brew 'zenith'                                           ## https://github.com/bvaisvil/zenith/

{{ if eq .chezmoi.os "darwin" -}}
brew 'codex'                                            ## https://github.com/openai/codex
brew 'coreutils'                                        ## https://github.com/Homebrew/homebrew-core
brew 'gnu-getopt'                                       ## https://github.com/util-linux/util-linux
brew 'mactop'                                           ## https://github.com/context-labs/mactop
brew 'pinentry-mac'                                     ## https://github.com/GPGTools/pinentry-mac
brew 'telnet'                                           ## https://github.com/apple-oss-distributions/remote_cmds
{{ if eq .machine.type "personal" -}}
brew 'dolt'                                             ## https://github.com/dolthub/dolt
brew 'mas'                                              ## https://github.com/mas-cli/masbrew 'opencode'                                         ## https://github.com/sst/opencode
brew 'opencode'                                         ## https://github.com/sst/opencode
brew 'ykman'                                            ## https://github.com/Yubico/yubikey-manager
{{ else if eq .machine.type "work" -}}
brew 'ansible'                                          ## https://github.com/ansible/ansible
brew 'gemini-cli'                                       ## https://github.com/google-gemini/gemini-cli
brew 'hashicorp/tap/vault-enterprise'                   ## https://github.com/hashicorp/vault
brew 'helm'                                             ## https://github.com/helm/helm
brew 'istioctl'                                         ## https://github.com/istio/istio
brew 'jfrog-cli'                                        ## https://github.com/jfrog/jfrog-cli
brew 'k9s'                                              ## https://github.com/derailed/k9s
brew 'kubent'                                           ## https://github.com/doitintl/kube-no-trouble
brew 'kubernetes-cli'                                   ## https://github.com/kubernetes/kubectl
brew 'postgresql@17'                                    ## https://git.postgresql.org/git/postgresql
brew 'tgswitch'                                         ## https://github.com/warrensbox/tgswitch
{{ end }}
{{ end -}}

## ================================================================================================================== ##
##                                                      Software                                                      ##
## ================================================================================================================== ##
cask 'font-caskaydia-cove-nerd-font'                    ## https://github.com/ryanoasis/nerd-fonts

{{ if eq .chezmoi.os "darwin" -}}
cask 'firefox'                                          ## https://www.mozilla.org/firefox
cask 'gpg-suite'                                        ## https://gpgtools.org
cask 'headlamp'                                         ## https://github.com/kubernetes-sigs/headlamp
cask 'jetbrains-toolbox'                                ## https://www.jetbrains.com/toolbox-app
cask 'libreoffice'                                      ## https://www.libreoffice.org/
cask 'meld'                                             ## https://gitlab.gnome.org/GNOME/meld
cask 'ngrok'                                            ## https://ngrok.com
cask 'obsidian'                                         ## https://github.com/obsidianmd/obsidian-releases
cask 'osquery'                                          ## https://github.com/osquery/osquery
cask 'powershell'                                       ## https://github.com/PowerShell/PowerShell
cask 'rambox'                                           ## https://rambox.pro
cask 'rectangle-pro'                                    ## https://github.com/rxhanson/Rectangle
cask 'tabby'                                            ## https://github.com/Eugeny/tabby
cask 'temurin'                                          ## https://github.com/adoptium
cask 'temurin@21'                                       ## https://github.com/adoptium/temurin21-binaries
cask 'visual-studio-code'                               ## https://code.visualstudio.com
cask 'windows-app'                                      ## https://aka.ms/WindowsApp

{{- if eq .machine.type "personal" }}
cask 'beyond-compare'                                   ## https://www.scootersoftware.com
cask 'lm-studio'                                        ## https://lmstudio.ai
cask 'makemkv'                                          ## https://www.makemkv.com
cask 'ollama-app'                                       ## https://ollama.com
cask 'perforce'                                         ## https://www.perforce.com
cask 'plex'                                             ## https://www.plex.tv
cask 'proton-drive'                                     ## https://proton.me/drive
cask 'proton-mail'                                      ## https://proton.me/mail
cask 'proton-pass'                                      ## https://proton.me/pass
cask 'protonvpn'                                        ## https://proton.me/vpn
cask 'signal'                                           ## https://signal.org
cask 'steam'                                            ## https://store.steampowered.com
cask 'unity-hub'                                        ## https://unity3d.com/get-unity/download

{{- if eq .machine.chassis "desktop" }}
cask 'raspberry-pi-imager'                              ## https://www.raspberrypi.org/downloads
cask 'yubico-yubikey-manager'                           ## https://github.com/Yubico/yubikey-manager-qt
{{- end }}

mas 'MacGoBluRayPlayer',  id: 1403952861                ## https://apps.apple.com/us/app/macgo-blu-ray-player/id1403952861?mt=12
mas 'XCode',              id: 497799835                 ## https://apps.apple.com/us/app/xcode/id497799835?mt=12
{{- else if eq .machine.type "work" }}
cask 'codeql'                                           ## https://github.com/github/codeql
cask 'dotnet-sdk'                                       ## https://www.microsoft.com/net/core#macos
cask 'gcloud-cli'                                       ## https://cloud.google.com/sdk
cask 'temurin@17'                                       ## https://github.com/adoptium/temurin17-binaries

{{- if eq .chezmoi.arch "arm64" }}
cask 'corretto@8'                                       ## https://github.com/corretto/corretto-8
{{- else }}
cask 'temurin@8'                                        ## https://github.com/adoptium/temurin8-binaries
{{- end }}
{{- end }}
{{- else if eq .chezmoi.os "linux" -}}
flatpak 'com.collaboraoffice.Office'
flatpak 'com.makemkv.MakeMKV'
flatpak 'fr.handbrake.ghb'
flatpak 'io.github.Faugus.faugus-launcher'
flatpak 'io.kinvolk.Headlamp'
flatpak 'it.mijorus.gearlever'
flatpak 'md.obsidian.Obsidian'
flatpak 'org.gnome.Meld'
flatpak 'tv.plex.PlexDesktop'
{{- end }}
